[{"time": null, "method": [], "name": "Banana Bread", "category": "Dessert", "ingredients": ["olive oil", "250 g self-raising flour , plus extra for dusting", "3 ripe bananas", "2 tablespoons fresh apple juice", "125 g unsalted butter", "2 large free-range eggs", "½ teaspoon ground cinnamon", "2 tablespoons runny honey", "OPTIONAL:", "50 g pecans"]}, {"time": null, "method": ["Put 100ml warm water in a jug and whisk in the yeast and half the sugar. Leave until the surface is covered in froth. Meanwhile, combine the flours, remaining sugar and salt in a large mixing bowl.", "Mix the oil and yeasty water in the flour with your fingertips, then add just enough of the remaining water to give you a “shaggy dough” – it should be soft, but not too sticky (note if you’re using all white flour, it probably won’t need as much as a wholemeal/white mix). Turn out on to a clean work surface and knead for about 10 minutes (or about 8 in a food mixer on a low speed) until smooth and elastic. Put into an oiled bowl, turn to coat in oil, then cover and refrigerate overnight, or leave somewhere warmish until doubled in size (about an hour to an hour and a half). Heat the oven to maximum, preferably fan, with a baking stone or heavy baking tray in there. Meanwhile, divide the dough into approximately 80g balls, cover with a damp tea towel and allow to rest for 10 minutes, then roll out on a floured surface to rounds about 0.5mm thick, making sure they are evenly thick all over. Cover with a damp tea towel and leave for 20 minutes.", "Operating as quickly as possible, put as many pitta as will comfortably fit on the hot stone or baking tray while it’s still in the oven, flipping them over as you pick them up, so the side resting on the work surface is now on top. Cook until they balloon, then carefully remove and keep warm in a tea towel while you cook the rest (how long this takes will depend on how hot your oven gets). Make sure to keep the oven door closed as much as possible to conserve heat. Eat the same day, or freeze."], "name": "Pitta Bread", "category": "Baking", "ingredients": ["400ml warm but not hot water", "10g active dried yeast", "2 tsp sugar", "400g strong white flour", "100g wholemeal flour (optional, or use 500g white)", "2 tsp salt", "2 tbsp olive oil, plus extra to grease"]}, {"time": null, "method": ["Rub together the flour and butter or whizz briefly in a food processor until you get coarse breadcrumbs. Mix in the sugar, a good pinch of salt and a generous grating of nutmeg then add the beaten yolks, a little at a time, until the pastry begins to come together; you may not need them all. Form into a ball, flatten then wrap and refrigerate for at least two hours, or overnight. Get the pastry out of the fridge to soften slightly while you grease a 21-23cm tart tin well. Roll out the pastry on a lightly floured surface as thinly as possible and use to line the tin, being careful not to stretch it, and using a ball of excess pastry to ease it into the sides. Leave it overhanging the edges and prick the base with a fork. Put in the freezer for 45 minutes, or the fridge for 1.5 hours. Heat the oven and a baking tray to 180C. Line the tart with foil and baking beans or rice, and bake for about 20-25 minutes until golden brown. Remove the beans and foil, patch up any holes with excess pastry and bake for another 10 minutes, then brush with the beaten whole egg and bake for another 2 minutes. Set aside to cool completely and turn down the oven to 120, leaving the tray in.", "Put the cream and milk in a heavy-based pan and bring slowly to a simmer. Meanwhile, whisk together the eggs, yolks and sugar in a heatproof bowl. Pour the hot cream mixture into the bowl, whisking continuously, then add more sugar to taste. Strain into a jug.", "Put the tart shell into the oven and carefully pour the custard into it (this makes it less likely to spill). Grate nutmeg over the top and bake for about 35-45 minutes until there is just the faintest wobble in the middle when shaken. Allow to cool completely before trimming the sides of the pastry and cutting."], "name": "Custard Tart", "category": "Dessert", "ingredients": ["For the pastry:", "225g plain flour", "115g cold butter, grated", "85g caster sugar", "Fine salt", "Nutmeg, to grate", "3 egg yolks, beaten, plus 1 whole egg (for brushing)", "For the custard:", "375g whipping cream", "90g creamy milk", "2 eggs, plus 2 yolks", "60g caster sugar, or to taste"]}, {"time": "30 mins", "method": ["Preheat the oven to 425 degrees F=220 degrees celsius. Drain the lentils and put into a pot and cover with water. Bring to a boil on med-high and then turn heat down and simmer until tender (This only takes about 5-10 minutes). Season the salmon fillets with a little pepper before wrapping them in the prosciutto slices. You can either wrap them whole or, wrap in the middle of the fillets, leaving some of the flesh exposed. Drizzle with olive oil and roast in the oven for around 10 minutes until the prosciutto is golden. While the salmon is in the oven and the lentils are simmering, season the plain yogurt with salt and pepper to your liking. Also go ahead and chop up all your herbs.", "Drain away the water from the lentils and season carefully with salt, pepper, the lemon juice and olive oil. Just before serving, stir the herbs and spinach into the lentils on a high heat, until wilted. Divide the lentils among 4 plates. Place a salmon fillet on top of your pile of lentils, and finish with a drizzle of lightly seasoned yogurt."], "name": "Salmon with Prosciutto and Lentils", "category": "Main", "ingredients": ["1 (450 g) can lentils", "4 (250 g) salmon fillets, skinned and pin-boned", "1 pinch salt", "1 pinch fresh ground black pepper", "8 slices prosciutto", "4 tablespoons olive oil", "1 lemon, juice of", "2 good handfuls mixed herbs, chopped (parsley, chives and dill)", "3 large handfuls spinach, chopped", "1 glass plain yogurt, lightly seasoned with", "salt and pepper"]}, {"time": null, "method": ["Preheat the oven to 180C / Fan 160C / Gas 4. Lightly grease a 2lb loaf tin, then line the base and sides with baking parchment. Measure all ingredients into a mixing bowl and beat for about 2 minutes, until well blended. Spoon the mixture into the tin and level the surface. Bake in the pre-heated oven for about 1 hour, until well risen and golden brown. A fine skewer inserted in the centre should come out clean if the loaf is ready. Leave to cool in the tin for a few minutes, then turn out, peel of the parchment and finish cooling on a wire rack."], "name": "Banana Loaf", "category": "Dessert", "ingredients": ["100g Softened Butter", "175g Caster Sugar", "2 Large Eggs", "2 Ripe Bananas (mashed)", "225g Self Raising Flour", "1 tsp. Baking Powder", "2 tbsp. Milk"]}, {"time": null, "method": ["2. Put the tomatoes, onion, butter, and salt in a 4- to 5-quart saucepan over medium heat. When the tomatoes begin to bubble, lower the heat to a slow but steady simmer. Cook, stirring every 10 to 15 minutes, until the tomatoes are no longer watery and the sauce has reduced, about 45 minutes, depending on the size and shape of the pot. The sauce is done when the butter has separated from the tomatoes and there is no remaining liquid."], "name": "Butter, Tomato, and Onion Sauce", "category": "Main", "ingredients": ["2 pounds ripe tomatoes, or 3 cups canned whole peeled tomatoes with their juice", "1 medium sweet yellow onion", "5 tablespoons butter", "1 1/4 teaspoons salt", "1. If using fresh tomatoes, peel them. Coarsely chop the fresh or canned tomatoes. Trim both ends of the onion; peel it and cut it in half lengthwise."]}, {"time": null, "method": ["The recipe", "Rinse 200g of spinach, removing any tough stems. While the leaves are still wet, cook them for a minute or two in a pan with a tight lid, so they soften in their own steam. If you are worried about them sticking add a tablespoon or two of water.", "As soon as the spinach has wilted, plunge it into a bowl of iced water to stop it cooking, squeeze it dry with your hands, then roughly chop it. Bring a pan of water to the boil then add 125g of sugar snap peas, let them cook for 2 minutes then remove and drain them.", "Bring a large pan of water to the boil, salt it, then cook 200g of bucatini or other thin pasta for about 9 minutes till just tender, and drain.", "Cut a large courgette into thick slices and then into quarters. Melt 30g of butter in a shallow pan then add 2 tbsp of olive oil. Fry the courgette for 3 or 4 minutes until it starts to colour, then add the spinach leaves and the cooked sugar snaps. Roughly chop a small bunch of parsley and add it to the vegetables.", "Pour 25ml of double cream into the vegetables and combine it gently. Let it simmer for a minute then pour it over the drained pasta and toss together gently. Garnish with lemon and pass round a bowl of grated parmesan.", "The trick", "The spinach needs to be cooked as briefly as possible, quickly cooled to retain its bright colour, then have all its water squeezed out. I like to steam the leaves in an enclosed pan while they are still damp with their rinsing water. If you are worried the leaves will stick, add a few spoonfuls of water to the pan. A bowl of water and ice cubes is a useful thing in which to plunge the steamed leaves, helping to retain their bright colour before wringing them almost, but not completely dry.", "The twist:", "Use a narrow ribbon pasta such a fettuccine instead of the bucatini. There is only enough cream in the recipe to coat the pasta, so if you decide to use a shape that will hold more sauce – such as orecchiette or conchiglie – then use a little more cream. The addition of tomatoes, quartered or roughly chopped, is tempting."], "name": "Bucatini with Spinach and Courgette", "category": "Pasta", "ingredients": ["Salt", "500g pasta"]}, {"time": null, "method": ["Trim the courgettes, cut them in quarters lengthways and chop into small, even pieces. (If you are using cucuzza, you will need to peel them first). Peel the garlic, then either press it gently with the back of a knife or, for a stronger flavour, chop it.", "In a large, deep pan, fry the garlic and chilli in 4 tbsp oil until the garlic is lightly golden and fragrant – you can now remove it if you like. Add the courgette (or cucuzza, or marrow) and add a pinch of salt, then stir so each piece is coated with oil and fry gently for a few more minutes. Add a small glass of water to the pan, then let the courgettes simmer until very soft and most of the water has gone. If they are ready before the pasta, pull the pan to one side.", "Meanwhile, bring a large pan of water to the boil, add salt, stir. Add the pasta, then cook until al dente – around 8 minutes.", "Heat 2 tbsp of olive oil in another small pan, add the breadcrumbs, almonds and a pinch of salt. Fry, shaking the pan, until just golden and toasty, then remove from the heat.", "Once the pasta is ready, drain or use a slotted spoon to lift it directly from the water on to the courgettes. Stir, divide between bowls, then top with crumbs."], "name": "Courgette, Breadcrumb and Almond Pasta", "category": "Pasta", "ingredients": ["4 courgettes or a long cucuzza", "1-2 fat cloves of garlic", "A pinch of red chilli flakes", "6 tbsp extra virgin olive oil", "Salt", "500g pasta", "A handful of dry breadcrumbs", "50g blanched almonds, roughly chopped"]}, {"time": "20 mins", "method": ["First, make the dressing. Tip the olives, anchovies and garlic into a large mortar and mash with a pestle until you have a very rough paste. Scrape into a bowl, if you like, stir in the lemon juice, olive oil and vinegar, then set aside.", "Cook the potatoes in boiling water for 15 mins until tender, then drain and set aside. Cook the beans in boiling salted water for 4-5 mins until tender with a slight crunch. Drain, tip into iced water, then drain again and set aside. Boil a small pan.", "Halve the potatoes and heat 2 tbsp oil in a non-stick frying pan. Place the potatoes cut-side down in the pan and sizzle for about 4 mins until golden and crisp. Toss the potatoes in the pan to brown on all sides, then turn up the heat and add the tomatoes. Fry the tomatoes for about 1 min until just starting to blister, then season. Splash in 1 tbsp of the balsamic vinegar, then turn off the heat and scatter over the basil.", "To cook the tuna, place a non-stick frying pan over a high heat, then turn the heat down to medium and add 1 tbsp oil. Season the tuna generously, then sear for 4 mins, leaving it undisturbed in the pan to brown. Turn over and continue to cook for 4 mins on the other side. This will give you very rare tuna. For rare, cook for 2 mins more on each side and for well done, add another 4 mins on each side. Set the tuna aside to rest for a few mins.", "To serve, whisk the remaining oil and vinegar with the lemon juice in a small bowl and toss in the lettuce wedges. Place a spoonful of olive dressing into 2 serving bowls, arrange the potatoes and tomatoes over, then put a pile of beans on top. Slice the tuna in half at a slight angle and place each half on top of the beans. Wedge the lettuce around the outside, halve the eggs and position in between the lettuce. Dollop a small spoonful of olive dressing on each egg."], "name": "Salad Nicoise", "category": "Salad", "ingredients": ["300g small new potato", "100g fine green bean, trimmed", "3 egg, as fresh as you can get them", "2 Baby Gem lettuce, outside leaves trimmed off", "5 tbsp extra-virgin olive oil", "200g cherry tomato, halved", "2 tbsp balsamic vinegar", "small handful basil leaves", "325g piece fresh tuna loin", "juice ½ lemon", "For the olive dressing:", "50g black olive, preferably Niçoise, pitted", "5 marinated anchovy fillets", "1 garlic clove", "juice ½ lemon", "4 tbsp olive oil", "1 tbsp balsamic vinegar"]}, {"time": null, "method": ["To make the pancakes, start by sieving the dry ingredients into a bowl and making a well in the middle and add the egg and milk into the well. Beat well until the mixture has the consistency of thick batter, adding a touch more flour or milk if its needed.", "To cook, heat a large frying pan over a medium heat with a dash of vegetable oil. To make sure I get evenly sized pancakes, I use a third of a cup measure to portion the batter into the pan. You could also use an ice cream soup or large spoon. In the pan, guide the batter into a circle.", "Once bubbles start to appear on the top of the pancakes, they're ready to be flipped!", "Cook the pancakes batch by batch, keeping them warm in a low oven until you're ready to eat them."], "name": "Scotch Pancakes", "category": "Baking", "ingredients": ["300g self - raising flour", "1.5 tsp baking powder", "60g caster sugar", "2 large eggs", "200ml milk", "a little vegetable oil"]}, {"time": "10 mins", "method": ["Heat the oil in a large pan, add the fennel seeds, carrots, celery and garlic, and cook for 5 mins until starting to soften. Tip in the leeks, tomatoes and stock, season and bring to the boil, then cover and simmer for 15-20 mins until the vegetables are tender and the sauce has thickened and reduced slightly.", "Add the fish, scatter over the prawns and cook for 2 mins more until lightly cooked. Ladle into bowls and serve with a spoon."], "name": "Simple Fish Stew", "category": "Main", "ingredients": ["1 tbsp olive oil", "1 tsp fennel seeds", "2 carrots, diced", "2 celery sticks, diced", "2 garlic cloves, finely chopped", "2 leeks, thinly sliced", "400g can chopped tomatoes", "500ml hot fish stock", "2 skinless pollock fillets (about 200g), thawed if frozen, and cut into chunks", "85g raw shelled king prawns"]}, {"time": "5 mins", "method": ["Heat oven to 200C/180C fan/gas 6. Heat the butter in a large ovenproof dish over a medium heat. Cook the leek for 4-5 mins, stirring regularly, until just tender. Add the rice and stir for a further 2 mins.", "Add the stock and milk, bring to the boil and bubble for 5 mins before sitting the haddock on top. Cover with a lid or foil and bake in the oven for 18 mins until the rice is tender.", "Fold in the crème fraîche and spinach, season with plenty of black pepper, then cover the pan again and leave to rest out of the oven for 3 mins before serving – the steam will soften the spinach."], "name": "Smoked Haddock & Leek Risotto", "category": "Main", "ingredients": ["small knob of butter", "1 large leek, thinly sliced", "300g risotto rice, such as arborio or carnaroli", "700ml fish or vegetable stock", "250ml full-fat milk", "375g undyed smoked haddock, skinned and cut into large chunks", "3 tbsp crème fraîche", "100g baby spinach"]}, {"time": null, "method": ["1. Heat the oil in a large frying pan and fry the chicken for 4-5 minutes, then add the soffritto mix and fry for a further 4 minutes.", "2. Stir in the spelt, stock and tomato purée. Bring to the boil, then cover and simmer for 20 minutes until the spelt is tender and the chicken is thoroughly cooked through with no pink meat.", "3. Stir through the basil and Serve with green vegetables."], "name": "Soffritto Chicken with Spelt", "category": "Main", "ingredients": ["1 tbsp olive oil", "500g pack essential Waitrose British Chicken Breast Fillets, cut into large pieces", "400g pack soffritto mix", "75g pearled spelt", "400ml chicken stock", "1 tbsp tomato purée", "½ x 25g pack basil, shredded"]}, {"time": "10m", "method": [], "name": "Sweet Potato and Chickpea Stew", "category": "Main", "ingredients": ["2 cans of tinned tomatoes (400ml each)", "1 can of coconut milk", "2 large sweet potatoes", "2 aubergines", "1 bag of spinach", "1 can of chickpeas (400g)", "4 tablespoons of tomato puree", "4 tablespoons of apple cider vinegar", "4 teaspoons of turmeric", "4 teaspoons of cumin", "1 teaspoon of cayenne pepper", "4 cloves of garlic", "fresh coriander", "brown rice or quinoa to serve"]}, {"time": null, "method": ["Cook the potatoes in a large pan of boiling salted water for 15-20 minutes or until tender.", "While the potatoes are cooking, mix the crème fraîche in a large bowl with the horseradish cream and lemon juice. Season well with freshly ground black pepper (there’s no need for salt because of the saltiness of the smoked mackerel).", "Drain the potatoes, halve and set aside to cool down for a few minutes. Tip into the crème fraîche mix and stir so it coats them and becomes quite runny. Now add the smoked mackerel and watercress and toss gently together. Pile on two plates and serve straight away (it’s best while still warm)."], "name": "Warm New Potato & Smoked Mackerel Salad", "category": "Salad", "ingredients": ["350g new potato", "100g crème fraîche", "1 tsp horseradish cream", "juice of 1 lemon", "2 smoked mackerel fillets (about 200g/8oz total weight), skinned and flaked", "85g bag watercress"]}]

